Revit 2026 API

# LoadComponent Properties

---

The LoadComponent type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Factor | Load component factor. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LoadCaseOrCombinationId | Load case or combination id. |

#### Reference

LoadComponent Class

Autodesk.Revit.DB.Structure Namespace